# scheduled_task_persistence.spl

Goal: Show off Data Source Integration (Windows Security + Sysmon).

Splunk SPL

      index=windows EventCode=4698 
      | rename TaskName as "Scheduled_Task_Name"
      | table _time, Scheduled_Task_Name, Author, Command, User, ComputerName

My final take: This detection relies on Event ID 4698. Crucially, I identified that this telemetry is not enabled by default in Windows. I updated the 'Advanced Audit Policy' for 'Object Access' to ensure visibility into T1053.005."
